# 3. Напишите программу, в которой пользователь будет задавать две строки,
#    программа - определять количество вхождений одной строки в другой.

str_first = input()
str_second = input()

print(str_first.count(str_second))
